#   4. 输入任意个学生的姓名,年龄和成绩,每个学生的信息存入
#     字典,然后放入到列表中.
#     要求: 每个学生的信息需要手动输入,姓名直接回车,结束输入
#     如:
#       请输入姓名: tarena
#       请输入年龄: 15
#       请输入成绩: 99
#       请输入姓名: name2
#       请输入年龄: 20
#       请输入成绩: 88
#       请输入姓名: <回车> # 结束输入
#     存内部存储格式如下:
#       [{'name':'tarena', 'age':15, 'score':99},
#        {'name':'name2', 'age':20, 'score':88}]
#     然后再用上面的列表,打印学生信息(形成表格)
#     +---------------+----------+----------+
#     |     姓名      |   年龄    |   成绩    |
#     +---------------+----------+----------+
#     |    tarena     |   15     |    99    |
#     |    name2      |   20     |    88    |
#     ...........
#     +---------------+----------+----------+

L = []  # 先创建一个空列表．准备放学生信息的字典

while True:
    n = input("请输入学生姓名: ")
    if not n:  # 如果姓名为空，结束输入
        break
    a = int(input("请输入学生年龄: "))
    s = int(input("请输入学生成绩: "))
    # 形成字符对象
    d = {}  # 每次创建一个新的字典.来存放当前学生的数据
    d['name'] = n
    d['age'] = a
    d['score'] = s
    # 放到列表中
    L.append(d)

print(L)



print("+---------------+----------+----------+")
print("|     姓名      |   年龄   |   成绩   |")
print("+---------------+----------+----------+")
for d in L:
    n = d['name']
    a = d['age']  # a 绑定的是整数
    s = d['score']
    a = str(a)
    s = str(s)  # 将整数转为字符串
    print("|%s|%s|%s|" % (n.center(15),
                          a.center(10),
                          s.center(10)))

# print("|    tarena     |   15     |    99    |")
# print("|    name2      |   20     |    88    |")
print("+---------------+----------+----------+")



